{"intents": [
  {"tag": "greetings",
  "patterns": ["hello", "hey", "hi", "good morning", "good evening", "what's up?", "greetings", "hi there", "hey you", "long time no see", "good afternoon"],
  "responses": ["Hello!", "Hey!", "What can I do for you?", "Salem!"]},
  {"tag": "thanks",
  "patterns": ["thank you!", "thanks", "i am so grateful", "im so grateful", "i appreciate it", "accept my deepest gratitude", "cheers", "that’s so kind of you", "much appreciated"],
  "responses": ["No problem!", "Glad I could help", "You're very welcome", "Pleased to help"]},
  {"tag":  "goodbye",
  "patterns":  ["goodbye", "bye", "see you later", "i am leaving", "have a good day", "see ya", "peace out", "goodnight", "have a nice day"],
  "responses": ["Goodbye!", "See you later!", "Have a nice day!", "Sau bol!"]},
  {"tag":  "identity",
  "patterns": ["who are you?", "how can i call you?", "how old are you?", "what is your name?", "how should i call you?",
  "tell me about yourself", "what is your age?", "what should i call you?", "can you tell me about yourself?", "what information do you have?", "what can you tell?", "what were you created for?"],
  "responses":  ["My name is Asyk. I don't know how old I am. I am an educational chatbot with the information about Kazakh Traditional Games!"]},
  {"tag": "information",
  "patterns": ["what is kazakh traditional games?", "give me the information", "tell me more about it", "tell the information", "tell me more", "i want to know more", "i am interested"],
  "responses": ["Like every nation, the Kazakhs have many national games, one of the peculiarities of which is the test of strength and endurance. Most often such games had a competitive character. Such games include: Tymak, Altybakan, Kyz Kuu, Kokpar, Audaryspak, Baiga, Tyime Alu, Alaman Baiga, Aksuyek, Oramal, Asau Mastek."]},
  {"tag": "tymak",
  "patterns": ["what is tymak?", "tell me more about tymak"],
  "responses": ["Knocking down a tymak is a Kazakh national game, in which anyone who knows how to ride and has a horse can take part. A pole, not taller than the rider, is stuck into the ground and a headdress - a tymak - is put on its top. The participant of the game is shown the place on which the tymak is placed, then tightly blindfolded and given a kamcha in his hands. After that the rider is spun in one place and released with the words: \"Now go and knock down the tymak\". If a player fails to knock down the tymak in three attempts, he may, by permission of the host, perform a song or improvisation, which gives him the right to take part in the competition again. The number of participants is not limited, everyone who has a riding horse can try his luck."]},
  {"tag": "altybakan",
  "patterns": ["what is altybakan?", "give me more information about altybakan"],
  "responses": ["\"Altybakan\" is a Kazakh national game, entertainment of youth. However, traditional moments of educational significance are of no small importance. In the evening, all the youth of the aul, dzhigits and girls, build \"Altybakan\" (swings: alty - six, bakan - pole) behind the aul. The game is of great importance in cognition of art, views of youth, their relations. Parents look at different entertainments of youth with indignation, but they have no right not to let them go to \"altybakan\" (especially girls). Here young people sing songs, play various games, and this fun goes on till midnight. \"Altybakan\" is a kind of entertainment leisure."]},
  {"tag": "kyz kuu",
  "patterns": ["what is kyz kuu?", "give me more information about kyz kuu"],
  "responses": ["Kyz Kuumai (catch up with the girl) is a national equestrian game in Kazakhstan and Kyrgyzstan. It involves boys and girls who compete in pairs on half-breed horses. In the first half of the game the girl is pursued by the boy and if she catches up, he kisses her; in the second half of the game they change places. The girl tries to catch up with her partner and in case of luck hits him with a kamcha. The distance of the race is 400-500 metres. At the end of the distance a flag is set up to mark the turning and control point. The girl (and the boy in the opposite direction) takes the start two horses ahead. Mastery of the game (for personal or team championship) is evaluated on a five-point system, with three attributes taken into account - the art of owning a horse, artistry (beauty) of performance and sharpness of the race. The participants perform in colourful national costumes on one-masted, spectacularly exterior[en] horses, thanks to which the spectacular side of the competition is very advantageous."]},
  {"tag": "kokpar",
  "patterns": ["what is kokpar?", "give me more information about kokpar"],
  "responses": ["The Kazakh national game of kokpar was played by dzhigits of auls neighbouring on the pasture. This competition was a test of strength, agility, marksmanship, ability to stay in the saddle. On the day of competition all participants and spectators gathered on the field. At a distance of 10-20 metres a ram carcass was thrown to the competitors. Thus began the struggle for kokpar, which could last until the evening."]},
  {"tag": "audarspak",
  "patterns": ["what is audarspak?", "give me more information about audarspak"],
  "responses": ["Audaryspak is a famous type of Kazakh folk wrestling - one of the types of wrestling of riders on horses (zhekpe - zhek oyyny). According to the rules of this type of equestrian wrestling it is allowed to \"carry\" the opponent only forward and to himself, as well as to ride ahead of the opponent, thus preventing him from moving forward. In addition, it is forbidden to use against each other nagayka - an indispensable attribute of any rider. The selection of a horse is of great importance in audaryspak. According to the established requirements, the most preferable are low, agile and strong horses. In the past, there were even specialists who were engaged in breeding and training such horses. Competitions in Kazakh martial arts, games and contests were usually organised during traditional holidays, as well as family celebrations. Often fights were also organised during leisure hours, for which it was enough just to challenge: \"Come on! Which of us is stronger?\". In the not so distant past, training in audaryspaku began in childhood. A Kazakh boy was accustomed to the saddle very early. He spent his first fights riding foals, rams or young bulls. Various games were also of great practical value, such as zhayaudaryspak, where the role of a horse was played by a partner. When dzhigits grew up, numerous competitions and duels for the sake of settling a dispute became the main method of training."]},
  {"tag": "baiga",
  "patterns": ["what us baiga?", "give me more information about baiga"],
  "responses": ["Players in pairs (horse and rider) stand on the start line so that they do not interfere with each other. The first player - the horse - stretches his arms backwards and downwards, the second - the rider - takes his hands and in this position the pairs run to the finish line. The rider who was the first to arrive at the finish line must jump up and get the patterned handkerchief hanging on the post."]},
  {"tag": "tүime alu",
  "patterns": ["what is tyime alu?", "give me more information about tyime alu"],
  "responses": ["The start and finish lines are marked on opposite sides of the court. A large number of coins (pebbles) are placed on the court. Players line up along the start line. At a signal, the dzhigits start racing - they move towards the finish line, imitating a horse race. During the race the dzhigits, without stopping, bend down and pick up coins. The winner is the one who was able to collect more coins during the race."]},
  {"tag": "alaman baiga",
  "patterns": ["what is alaman baiga?", "give me more information about alaman baiga"],
  "responses": ["The Kazakh national game \"Alaman Baiga\" is a test not only for riders, but mainly for horses. Alaman Baiga is an equestrian competition, a race for long and extra-long distances. The historical roots of this game are based on the Kazakhs' need to prepare horses for long journeys during migrations to new places, as well as the selection of the hardiest and strongest horses to improve the breed. So gradually Alaman baiga became an integral part of big festivals. Sometimes during such competitions some horses could not withstand the load and died before reaching the finish line or fell from fatigue, breaking their legs. It is known that riders before races, in order to protect their horses from the evil eye, braided their tails and manes into braids and wove in it owl feathers or amulets against the evil eye, and also tried not to show the horse to anyone, keeping it under a blanket."]},
  {"tag": "aksuyek",
  "patterns": ["what is aksuyek?", "give me more information about aksuyek"],
  "responses": ["The participants of the game stand in a line. The leader takes a white bone (you can use a rubber ball, a wooden key, carved sticks, etc.) and chants: White bone - a sign of happiness, a key, Fly to the moon, to white snowy peaks! The one who finds you in a moment is lucky and happy!\n\nAfter that the host throws the bone behind the row of players. At this moment no one should look back, so as not to see in which direction the bone flies. When the bone falls, the host announces: Look for the bone, you'll find happiness soon! And he who is quicker and more skilful will find it!\n\nThe aim of the activity is to find the bone quickly and bring it to the leader without being noticed by the others. If the children notice it, they chase the player and, with a slight tap on the shoulder, take away the bone, then also run to the leader. In order to be inconspicuous and without obstacles to bring the bone to the leader, you can show cunning, resourcefulness. Some player, under the pretext that he cannot find the bone, goes to the leader by steps, distracts the attention of opponents in various ways (for example, loudly speaks, pointing to another, and claims that he allegedly has the bone, etc.). If a player finds the bone, i.e. is lucky, the whole group or one of the group fulfils his wish: singing, reciting poems, imitating the voices of animals."]},
  {"tag": "oramal",
  "patterns": ["what is oramal?", "give me more information about oramal"],
  "responses": ["The leader gives one of the participants a handkerchief tied in a knot. The participants form a circle around the leader. At the leader's command \"One, two, three!\" all participants run away. The leader must catch up with the player with the handkerchief, touch his shoulder and take the handkerchief. At the moment of pursuit, the player with the handkerchief can pass it to his mate, the latter to the next one, etc. If the leader catches the player with the handkerchief, he must fulfil any of his wishes: sing a song, read a poem, etc. After that he becomes the leader."]},
  {"tag": "asau mastek",
  "patterns": ["what is asau mastek?", "give me more information about asau mastek"],
  "responses": ["Each player sits on a special structure called \"asau mastek\" and tries to pick up as many skullcaps from the ground as possible without losing their balance."]}
]
}